{
  "translation": {
    "es": "Spanish",
    "en": "English",
    "Audit report": "Audit report",
    "Build by Ethereum Foundation, R&D team": {
      " 2022": "Build by Ethereum Foundation, R&D team. 2022"
    },
    "Documentation": "Documentation",
    "complete": {
      "button": "View your contribution",
      "description": "<0>Success! Echoes of you are permanently fused with the others in this Summoning Ceremony.</0>",
      "title": "Dankshard <br/> draws near"
    },
    "contributing": {
      "button": "View your contribution",
      "description": {
        "contributing": "<0>You are now entrusted with the Powers of Tau. Your Secret, Sigil, and Sample are being fused with those that came before.</0><1>Rituals cannot be hastened - time given here creates timeless artifacts.</1>",
        "completed": "<0>You have just succesfully complete the contribution. Don’t forget to return for the summoning ending & spread the words.</0>",
        "error": "There was an error {{error}}. Reload and try again"
      },
      "title": {
        "contributing": "You have been <br /> called upon <br /> Now",
        "completed": "Contribution <br /> Complete",
        "error": "Something <br /> Went <br /> Wrong"
      }
    },
    "doubleSign": {
      "button": "Sign",
      "description": "<0>This signature binds each Summoner’s entropy contribution to their Ethereum address.</0>",
      "title": "Bind your <br/> Contribution"
    },
    "entropyInput": {
      "button": "Submit",
      "description": "<0>The Ceremony requires three random inputs from each Summoner.</0><1><0>Secret:</0> A piece of you in text form, with random characters added. A hope for the future, or the name of someone dear.</1><2><0>Sigil:</0> Trace some elements of the guide with your cursor - the interface will capture your unique path.</2><3><0>Sample:</0> Your browser will generate its own randomness in the background.</3>",
      "title": "Entropy <br/> Entry"
    },
    "explanation": {
      "button": "View contributions",
      "description": "<0>This Trusted Setup is a multi-party ceremony designed to generate a secure SRS (structured reference string) to be used in the proto-danksharding protocol. OK, let's slow down and talk about those terms in more detail.</0><1>Proto-danksharding (aka EIP-4844) is a planned change to the Ethereum protocol which allows transaction data from rollups (Layer 2s) to be succinctly represented on the Layer 1 (mainnet). The benefits are lower transaction fees on the L2, greater scalability and more accessibility to more people!</1><2>The Trusted Setup is a preparatory step required for certain cryptographic schemes such as the KZG polynomial commitment scheme to be used in proto-danksharding. In our case, the trust assumption is that one contributor needs to successfully conceal their secret for the result to be secure.</2><3>It's a multi-party ceremony: Contributors each create a secret and run a computation to mix it with previous contributions and generate a result that can be made public and passed to the next contributor. We need to guard against attempts to control the ceremony, so you'll need an Ethereum or GitHub account with an established history.</3>",
      "title": "PROTO-DANKSHARDING <br/> AND THE CEREMONY"
    },
    "header": {
      "offline": "Offline",
      "online": "Online",
      "sequencer": "Sequencer"
    },
    "landing": {
      "button": "Begin",
      "description": "<0>Whispers from the shadows tell of a powerful spirit Dankshard, who will open the next chapter of Ethereum scalability. To summon its powers, a Ceremony needs your contribution. This illuminated guide will lead you through the movements necessary to complete the ritual.</0><1>Magic math awaits - are you ready to add your color to the story?</1>",
      "learn-more": "↓ or learn more below ↓",
      "title": "SUMMONING <br/> GUIDE"
    },
    "lobby": {
      "description": "<0>Your contribution is ready to be accepted by the Sequencer. Please leave this guide open in the background and we will add your contribution to the others soon.</0><1>Please leave this guide open and awake.</1>",
      "title": "Waiting to be <br/> submitted"
    },
    "lobbyFull": {
      "button": "Return to home",
      "description": "<0>Too many summoners at this time, please come back later. Close this window and try again in a moment to check if there is a slot available in the lobby.</0>",
      "title": "Too much <br/> magic"
    },
    "mobile": {
      "description": "Ceremony contributions are only possible in the desktop setting. See you there!"
    },
    "signin": {
      "description": "<0>The Ceremony requires souls of pure intent. Summoners show their integrity by unlocking with an address that has at least three sent transactions.</0><1>It does not send any funds or permit any contracts. This method also allows us to deliver a POAP after the Ceremony.</1>",
      "title": "OPEN <br/> THE WAY",
      "unlockWithEthereum": "Unlock with Ethereum <2></2>",
      "unlockWithGithub": "or unlock with Github"
    },
    "error": {
      "notSameWallet": "Use the same wallet you used to signing with Ethereum",
      "pastSubgroupChecksFailed": "Subgroup check failed in the contribution you received. Please report it inmmediately",
      "newSubgroupChecksFailed": "Subgroup check failed in your computed contribution. Please check your setup and try again",
      "tryContributeError": {
        "rateLimited": "Your call to the sequencer came too early. Remember that there is a specific time interval between calls",
        "unknownSessionId": "You might have taken more time than expected in the lobby. Please reload and sign in again with a different account",
        "anotherContributionInProgress": "There is another contribution been computed at the moment. Please wait for your turn to contribute",
        "unknownError": "There has been an unknown error: {{error}} . code: {{code}}"
      },
      "authErrorPayload": {
        "userAlreadyContributed": "This wallet has already contributed to the ceremony",
        "invalidAuthCode": "The web application is using an invalid authorization code. Please report it on Github",
        "fetchUserDataError": "The sequencer could not get user data from the authorization service. Please report it on Github",
        "couldNotExtractUserData": "The sequencer could not extract user data from the authorization service. Please report it on Github",
        "userCreatedAfterDeadline": "Your wallet does not have the minimum transaction quantity to pass our antisybil tests.",
        "customError": "There has been an unknown error: {{error}}"
      }
    }
  }
}
