{
  "translation": {
    "language": {
      "es": "Español",
      "en": "Inglés"
    },
    "header": {
      "offline": "Offline",
      "online": "Online",
      "title": "Ceremonia de Test",
      "sequencer": "Sequenciador"
    },
    "complete": {
      "title": "Dankshard <br/> está cerca",
      "description": "<0>¡Éxito! Una parte de usted se fusionó permanentemente con los demás en esta Ceremonia de Invocación.</0><1><0>Recuerde:</0>Esta es una Ceremonia en la red de prueba - asegúrese de regresar para la invocación completa de Dankshard.</1>",
      "button": "Vea su contribución",
      "modal": {
        "keys": "MIS LLAVES",
        "timestamp": "Contribución completada el:",
        "acknowledgment": "RECONOCIMIENTO DEL SEQUENCIADOR",
        "receipt": "Recibo de la contribución:",
        "signedBy": "Firmado por",
        "integrityChecks": "Pruebas de integridad",
        "shareTwitter": "Compartir en Twitter",
        "downloadReceipt": "Descargar Recibo",
        "tweet": "Acabo de contribuir a la ceremonia KZG de prueba para escalar Ethereum usando {{identity}}",
        "checks": {
          "failedWitness": "Testigo no es igual a llave pública Powers of Tau",
          "failedComputeSignature": "No se pudo procesar la firma",
          "failedSignature": "Firma del sequenciador no contiene wallet del sequenciador",
          "success": "Aprobadas"
        }
      }
    },
    "contributing": {
      "button": "Vea su contribución",
      "description": {
        "contributing": "<0>Le han confiado los Poderes de Tau. Su Secreto, Sello y Muestra serán fusionados con los que vinieron anteriormente.</0><1>Los rituales no deben ser apresurados - el tiempo invertido crea artefactos eternos.</1>",
        "completed": "<0>Ha completado exitosamente la contribución. No olvide de regresar al final de la ceremonia para compartir la noticia.</0>",
        "error": "Hubo un error {{error}}. Recarga e intenta de nuevo"
      },
      "title": {
        "contributing": "Ha sido <br /> elegido <br /> ahora",
        "completed": "Contribución <br /> Completada",
        "error": "Algo <br /> Salió <br /> mal"
      }
    },
    "doubleSign": {
      "title": "Vincule su <br /> Contribución",
      "description": "<0>Esta firma vincula la contribución entrópica de cada Invocador a su dirección de Ethereum.</0>",
      "button": "Firmar"
    },
    "entropyInput": {
      "title": "Ingresar <br /> Entropía",
      "description": "<0>La Ceremonia requiere tres entradas aleatorias de cada Invocador.</0><1><0>Secreto:</0> Una parte de usted en forma de texto, caracteres añadidos al azar. Pueden serunas palabras para el futuro, o el nombre de un ser querido.</1><2><0>Sello:</0> Recorra algunos elementos de la guía con el cursor - la interface capturará tu recorrido único.</2><3><0>Muestra:</0> Su navegador generara su propia aleatoriedad en segundo plano.</3>",
      "button": "Enviar"
    },
    "landing": {
      "title": "GUÍA DE <br/> INVOCACIÓN",
      "description": "<0>Los susurros provenientes de las sombras hablan del poderoso espiritu Dankshard, que abrirá las puertas del próximo capítulo de la escalabilidad de Ethereum. Para invocar sus poderes, una Ceremonia necesita de su contribución. Esta guía iluminada te conducirá a través de los movimientos para completar el ritual.</0><1>La magia de las matemáticas te esperan: ¿está preparado para ser parte de esta historia?</1>",
      "button": "Comenzar",
      "learn-more": "↓ o infórmese a continuación ↓"
    },
    "explanation": {
      "title": "PROTO-DANKSHARDING <br /> Y LA CEREMONIA",
      "description": "<0>Esta configuración de confianza es una Ceremonia multi-party diseñada para generar una SRS segura (structured reference string ó cadena de referencia estructurada) que se utilizará en el protocolo proto-danksharding. OK, vamos a ir más despacio y a hablar de estos términos con más detalle.</0><1>Proto-danksharding (también conocido como EIP-4844) es un cambio previsto en el protocolo de Ethereum que permite que los datos de las transacciones de los rollups (Layer 2) sean sucintamente representados en la Layer 1 (mainnet). Los beneficios son fees de transacción más bajos en la L2, mayor escalabilidad y ¡más accesibilidad a más personas!</1><2>La configuración de confianza es un paso preparatorio necesario para ciertos esquemas criptográficos como el esquema de compromiso polinomial KZG, que será utilizado en el proto-danksharding. En nuestro caso, el sujeto de confianza es un contribuyente que necesita ocultar con éxito su secreto para para que el resultado sea seguro.</2><3>En una Ceremonia multi-party: cada uno de los contribuyentes crea un secreto y ejecuta un cálculo para mezclarlo con las contribuciones anteriores y generar un resultado que se puede hacer público y pasar al siguiente contribuyente. Necesitamos protegernos contra los intentos de sabotear la ceremonia, por lo que necesitarás una cuenta de Ethereum o GitHub con un historial establecido.</3>",
      "button": "Ver contribuciones"
    },
    "lobby": {
      "title": "A la espera de ser <br /> Enviada",
      "lobby_size": "participantes en el lobby",
      "description": "<0>Su contribución está lista para ser aceptada por el secuenciador. Por favor, deje esta guía abierta y añadiremos su contribución a las otras en breve.</0><1>Deje esta guía abierta y este atento.</1>"
    },
    "lobbyFull": {
      "title": "La suma de las partes.",
      "description": "<0>Por favor, deje esta guía abierta - su contribución se verá en breve.</0><1>Muchos otros están junto a usted en esta Ceremonia - su paciencia será recompensada.</1>",
      "button": "Volver a Inicio"
    },
    "record": {
      "headers": "<0>#</0><1>Identificador</1><2>Firmas</2>",
      "loading": "Cargando manuscrito...",
      "searchBar": "Buscar wallet, ENS, usuario de github, #1, ...",
      "button": "Ver",
      "title": "Manuscrito de Contribuciones",
      "stats": {
        "lobby": "Lobby:",
        "contributions": "Contribuciones:",
        "address": "Wallet sequenciador:"
      },
      "transcriptModal": {
        "title": "Detalle de la contribución",
        "id": "ID del participante:",
        "potpubkeys": "Llaves públicas Powers of Tau:",
        "bls": "Firmas BLS:",
        "ecdsa": "Firma ECDSA (opcional):",
        "potPubkeyTooltip": "Tu llave pública Powers of Tau representa tu huella única asegurando Ethereum. Fue generada por tu secreto."
      },
      "signatureModal": {
        "title": "Llaves públicas PoT:"
      }
    },
    "signin": {
      "title": "ABRIR <br /> EL CAMINO",
      "description": "<0>La Ceremonia requiere almas de intenciones puras. Los invocadores demuestran su integridad al desbloquear una dirección que tenga al menos tres transacciones enviadas.</0><1>Esto no envía fondos ni aprueba ningún contrato. Este método nos permite entregar un POAP después de la Ceremonia.</1>",
      "unlockWithEthereum": "Desbloquear con Ethereum <2></2>",
      "unlockWithGithub": "ó desbloquear con Github <2></2>"
    },
    "error":{
      "notSameWallet": "Utiliza la misma wallet que utilizaste para iniciar sesión con Ethereum",
      "incorrectChainId": "Selecciona la red Ethereum Mainnet en la wallet que firma",
      "pastSubgroupChecksFailed": "El control de subgrupos falló en la contribución que recibiste. Por favor reportelo inmediatamente",
      "newSubgroupChecksFailed": "El control de subgrupos falló en la contribución que computó. Por favor revise su configuración e intente de nuevo",
      "tryContributeError": {
        "rateLimited": "La llamada al sequenciador se realizó muy temprano. Publica el bug en Github",
        "unknownSessionId": "Usuario no conocido. Por favor inicia nuevamente con una cuenta diferente",
        "anotherContributionInProgress": "Existe otra contribución siendo computada. Por favor espere su turno para contribuir",
        "unknownError": "Ocurrió un error desconocido: {{error}} . código: {{code}}"
      },
      "authErrorPayload": {
        "userAlreadyContributed": "Esta wallet ya ha contribuido a esta ceremonia",
        "invalidAuthCode": "La aplicación web está utilizando un código de autorización inválido. Por favor reportelo en Github",
        "fetchUserDataError": "El sequenciador no pudo conseguir los datos de usuario del servidor de autorización. Por favor reportelo en Github",
        "couldNotExtractUserData": "El sequenciador no pudo extraer los datos de usuario del servidor de autorización. Por favor reportelo en Github",
        "userCreatedAfterDeadline": "Su wallet no tiene la cantidad mínima de transacciones requeridas para pasar nuestro método antisybil. Utilice otra wallet",
        "customError": "Ocurrió un error desconocido: {{error}}"
      },
      "contributeError": {
        "notUsersTurn": "No es su turno de subir la contribución",
        "invalidContribution": {
          "unexpectedNumContributions": "Se ha enviado un número inesperado de contribuciones"
        },
        "signature": {
          "signatureCreation": "Hubo un problema creando el recibo firmado",
          "invalidToken": "La firma no tiene un formato hexadecimal correcto",
          "invalidSignature": "El sequenciador no pudo validar la firma"
        },
        "customError": "Ocurrió un error desconocido: {{error}}"
      }
    }
  }
}
